In [3]:
#P(F^A)=a
#P(F)=b
#P(A/F)=c
a=0.03
b=0.2
c=a/b
print(c)

0.15

In [4]:
import mysql.connector

In [5]:
mydb=mysql.connector.connect(
host="localhost",
user="root",
password="root",
database="college"    
)

In [6]:
mycursor=mydb.cursor()
mycursor.execute("select *from student")
myresult=mycursor.fetchall()

In [7]:
for x in myresult:
    print(x)

(1, 'Aravind', 98, 123)
(2, 'Rajesh', 65, 420)
(3, 'Mukesh', 55, 321)
(4, 'xyz', 89, 491)
(5, 'abc', 12, 981)
(6, 'kz', 22, 231)
(7, 'sdc', 45, 221)
(8, 'yvr', 25, 774)

## KNN

In [48]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [70]:
df=pd.read_csv('weight-height.csv')

In [71]:
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [72]:
df.isnull().sum()

Gender    0
Height    0
Weight    0
dtype: int64

In [73]:
gender=pd.get_dummies(df['Gender'],drop_first=True)

In [74]:
gender

      Male
0        1
1        1
2        1
3        1
4        1
...    ...
9995     0
9996     0
9997     0
9998     0
9999     0

[10000 rows x 1 columns]

In [75]:
df=df.join(gender)

In [79]:
df=df.drop(columns=['Gender'])

In [80]:
df

         Height      Weight  Male
0     73.847017  241.893563     1
1     68.781904  162.310473     1
2     74.110105  212.740856     1
3     71.730978  220.042470     1
4     69.881796  206.349801     1
...         ...         ...   ...
9995  66.172652  136.777454     0
9996  67.067155  170.867906     0
9997  63.867992  128.475319     0
9998  69.034243  163.852461     0
9999  61.944246  113.649103     0

[10000 rows x 3 columns]

In [81]:
x=df[['Height','Weight']]
Y=df['Male']


from sklearn.neighbors import KNeighborsClassifier

model = KNeighborsClassifier(n_neighbors=3)

model.fit(x,Y)

KNeighborsClassifier(n_neighbors=3)

In [83]:
model.predict([[69.881796,206.349801]])

array([1], dtype=uint8)

In [86]:
model.score(x,Y)

0.9374

## Find s algorithm